{
  "backend/main.mo": "Main Motoko actor defining data types and storage maps for market symbols, option chains, watchlists, and user profiles, with access-controlled CRUD endpoints and an HTTP outcall transform function.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, describing their roles in the JAAHNAVI F&O analytics app.",
  "frontend/index.css": "Global CSS file importing Tailwind directives and defining CSS custom property tokens for light and dark themes including colors, radius, chart palette, and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point for the Vite/React app, mounting the React root div and loading the main TSX module.",
  "frontend/src/App.tsx": "Root React component that initializes live market data and NSE polling hooks, manages authentication state and view routing, and composes the full app shell with Sidebar, Header, NewsTicker, and view components.",
  "frontend/src/components/CandlestickChart.tsx": "Canvas-based candlestick chart component that generates simulated OHLC candles seeded from live market data for a given symbol and redraws on each live data tick.",
  "frontend/src/components/Header.tsx": "Sticky top header displaying the app logo, live NIFTY/BANKNIFTY prices, an exported NSEStatusBadge showing live/delayed/offline status with last fetch time, a clock, search input, and logout button.",
  "frontend/src/components/LoginScreen.tsx": "Renders a login form for the JAAHNAVI dashboard that validates hardcoded admin/admin credentials with a simulated async check and shows toast notifications on failure.",
  "frontend/src/components/NewsTicker.tsx": "Displays a horizontally scrolling news ticker bar that duplicates NEWS_HEADLINES constants to create a continuous looping animation.",
  "frontend/src/components/Sidebar.tsx": "Renders the main navigation sidebar with icons and labels for all app views, highlighting the active route and applying bullish/bearish accent colors to scanner items.",
  "frontend/src/components/SignupScreen.tsx": "Renders a signup form collecting name, username, and password with basic validation, simulates account creation, then redirects back to the login screen on success.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, initializing it with the current Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, exposing login/logout functions and identity state to the component tree.",
  "frontend/src/hooks/useQueries.ts": "Defines types and seed data for live market state (stocks, indices, sectors) and exports React Query hooks for fetching and simulating real-time NSE F&O market data with fallback base prices.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives, defines dark-themed CSS custom properties for colors/radii/sidebar, and adds a ticker keyframe animation utility.",
  "frontend/src/lib/analytics.ts": "Provides analytics utilities including OI/price scenario classification, synthetic option chain generation, and candlestick pattern detection (Hammer, Engulfing, etc.).",
  "frontend/src/lib/constants.ts": "Exports a large list of F&O-tradeable NSE stock symbols and a set of sample news headlines used across the frontend.",
  "frontend/src/lib/nseClient.ts": "Defines TypeScript interfaces for NSE data shapes and provides async helper functions to fetch market snapshots, indices, option chain data, and trigger backend refreshes via an actor proxy.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/src/views/BearishScannerView.tsx": "React view that scans live market data for stocks where the open price is within 0.5% of the day high, displaying them in a table as bearish signals.",
  "frontend/src/views/BullishScannerView.tsx": "Displays a scanner table of F&O stocks where the opening price is within 0.5% of the day's low, indicating a bullish 'Open = Low' signal. Filters and sorts live market data by proximity threshold.",
  "frontend/src/views/CandleAnalysisView.tsx": "Analyzes F&O stocks for candlestick patterns (bullish, bearish, neutral) using live and simulated OHLC data, then displays results in three categorized columns with mini candlestick charts.",
  "frontend/src/views/Dashboard.tsx": "Main market dashboard showing live NSE indices, FII/DII data, market breadth, and connection status with real-time price updates and NSE data source info banner.",
  "frontend/src/views/FOListView.tsx": "Renders a live-updating table of all F&O symbols with price flash animations on changes, showing LTP, change%, OHLC, volume, VWAP, and OI with an option to add symbols to a watchlist.",
  "frontend/src/views/NewsFeedView.tsx": "Displays a static list of market news headlines from constants, each shown as a card with a title, subtitle, and a 'Read Analysis' button.",
  "frontend/src/views/OptionChainView.tsx": "Shows an interactive option chain for selected F&O symbols, supporting both live backend data and simulated generation, with strike-level CE/PE details including OI, DOI, IV, VWAP, and scenario classification.",
  "frontend/src/views/SectorsView.tsx": "Displays live sector performance cards for 8 NIFTY sectors, showing change percentage, a strength bar, and color-coded top constituent stocks using live market data.",
  "frontend/src/views/WatchlistView.tsx": "Renders a watchlist table with live-enriched stock data (LTP, change%, high, low, volume, VWAP, OI) and supports removing symbols via a delete button.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom OKLCH-based color tokens, border radius, backdrop blur, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state manifest (version 19) describing the JAAHNAVI trading dashboard's architecture, existing features, known issues (CORS, index scaling), and feature history."
}