{
  "backend/main.mo": "Main Motoko actor implementing authentication, user profiles, option chain data, bullish/bearish scanners, candlestick patterns, watchlist management, and market data storage with role-based access control.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: expanded candlestick pattern detection (16 patterns), categorized pattern display in CandleAnalysisView (bullish/bearish/neutral sections), and category descriptions with trading bias indicators.",
  "frontend-file-summaries.txt": "Pre-generated summaries of frontend files including App.tsx, views, components, hooks, and utility files describing authentication, routing, market data display, scanners, and analytics functionality.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, card, sidebar, chart colors, and other UI tokens.",
  "frontend/index.html": "HTML entry point for the JAAHNAVI application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component managing authentication state, view routing between 9 views (dashboard, watchlist, option chain, scanners, etc.), login/signup flow, and layout composition with sidebar, header, and news ticker.",
  "frontend/src/components/CandlestickChart.tsx": "Canvas-based candlestick chart component rendering 60 candles with OHLC data, green/red coloring based on price direction, wicks, and moving average overlay line.",
  "frontend/src/components/Header.tsx": "Top navigation header displaying live IST time, market status, symbol search input with validation against STOCKS constant, and logout button.",
  "frontend/src/components/LoginScreen.tsx": "Login screen component with username/password inputs, hardcoded admin/admin credentials for demo authentication, and a link to navigate to signup screen.",
  "frontend/src/components/NewsTicker.tsx": "Animated horizontal news ticker component that displays news headlines from constants in a continuous scrolling loop with 'LIVE' badges.",
  "frontend/src/components/Sidebar.tsx": "Navigation sidebar component displaying menu items (Dashboard, Watchlist, Option Chain, Scanners, etc.) with icons and active state highlighting.",
  "frontend/src/components/SignupScreen.tsx": "User registration screen with form inputs for name, username, and password; calls backend signup mutation and navigates back to login on success.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control with admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for fetching market data, managing watchlist (add/get operations), and user signup functionality via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for dark theme colors (using OKLCH color space), sidebar styling, and ticker animation keyframes.",
  "frontend/src/lib/analytics.ts": "Provides analytics functions including scenario detection (Long Build Up, Short Covering, etc.) based on price and OI changes, generates mock option chain data with strikes/OI/IV, and detects candlestick patterns (Hammer, Engulfing, Doji, etc.) from OHLC data.",
  "frontend/src/lib/constants.ts": "Defines a list of stock symbols (NIFTY, BANKNIFTY, major Indian stocks, plus 150 generated STOCK100-STOCK249) and sample news headlines for market data display.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, persisting them in sessionStorage, and clearing sensitive parameters from the URL after extraction.",
  "frontend/src/views/BearishScannerView.tsx": "Displays a scanner for bearish stocks where Open equals High, filtering stocks within 0.5% proximity to that level and showing them in a table with OHLC data and bearish badges.",
  "frontend/src/views/BullishScannerView.tsx": "Displays a scanner for bullish stocks where Open equals Low, filtering stocks within 0.5% proximity to that level and showing them in a table with OHLC data and bullish badges.",
  "frontend/src/views/CandleAnalysisView.tsx": "Analyzes all stocks for candlestick patterns using detectCandlestickPatterns, then categorizes and displays them in three sections (bullish, bearish, neutral) with pattern names and trading bias recommendations.",
  "frontend/src/views/Dashboard.tsx": "Main dashboard view displaying market indices (NIFTY, BANK NIFTY, SENSEX, etc.) with prices, changes, and phases, plus FII/DII cash flow, market breadth metrics, and a candlestick chart component.",
  "frontend/src/views/FOListView.tsx": "Displays a table of F&O stocks (up to 100) with price, change, volume data, and allows adding stocks to watchlist via button click.",
  "frontend/src/views/NewsFeedView.tsx": "Renders a list of market news headlines from constants with newspaper icons and 'Read Analysis' buttons for each item.",
  "frontend/src/views/OptionChainView.tsx": "Shows option chain data for a selected symbol with best CE/PE strikes based on OI analysis, market prediction, PCR ratio, and a detailed option chain table (truncated in source).",
  "frontend/src/views/SectorsView.tsx": "Displays sector performance cards (IT, BANK, AUTO, PHARMA, FMCG, METAL) showing percentage change and strength, with click handlers showing toast notifications.",
  "frontend/src/views/WatchlistView.tsx": "Shows user's watchlist in a table with symbol, price, change columns and remove buttons; clicking symbols triggers navigation callback.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme for charts/sidebar, container queries, typography, and animation plugins.",
  "project_state.json": "Project state metadata tracking a financial trading dashboard (JAAHNAVI) with 18 implemented features including authentication, market indices, option chain analysis, stock scanners, candlestick patterns, sector performance, news feed, and real-time data visualization. Architecture uses vanilla JavaScript with mock data simulation, canvas-based charting, client-side state management, and view-based routing without external framework dependencies."
}